avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/signaling.c
static ssize_t wslay_recv_cb(wslay_event_context_ptr ctx, uint8_t *buf, size_t len,
                             int flags, void *user_data) {
    (void) flags;
    SignalingHandle sig = (SignalingHandle) user_data;
    int32_t n = cy_awsport_network_receive(&sig->net_ctx, buf, len);
    if (n < 0) {
        sig->transport_error = true;
        wslay_event_set_error(ctx, WSLAY_ERR_CALLBACK_FAILURE);
        printf("[signaling] wslay recv: socket error %d\n", (int) n);
        return -1;
    }
    if (0 == n) {
        // Per-call socket timeout — wslay treats WOULDBLOCK as "stop receiving
        // for this tick, try again later".
        wslay_event_set_error(ctx, WSLAY_ERR_WOULDBLOCK);
        return -1;
    }
    return (ssize_t) n;
}

static ssize_t wslay_send_cb(wslay_event_context_ptr ctx, const uint8_t *data, size_t len,
                             int flags, void *user_data) {
    (void) flags;
    SignalingHandle sig = (SignalingHandle) user_data;
    int32_t n = cy_awsport_network_send(&sig->net_ctx, data, len);
    if (n < 0) {
        sig->transport_error = true;
        wslay_event_set_error(ctx, WSLAY_ERR_CALLBACK_FAILURE);
        printf("[signaling] wslay send: socket error %d\n", (int) n);
        return -1;
    }
    if (0 == n) {
        wslay_event_set_error(ctx, WSLAY_ERR_WOULDBLOCK);
        return -1;
    }
    return (ssize_t) n;
}

static int wslay_genmask_cb(wslay_event_context_ptr ctx, uint8_t *buf, size_t len,
                            void *user_data) {
    (void) ctx;
    (void) user_data;
    if (0 != webrtc_csprng_bytes(buf, len)) {
        return -1;
    }
    return 0;
}

static void wslay_on_msg_recv_cb(wslay_event_context_ptr ctx,
                                 const struct wslay_event_on_msg_recv_arg *arg,
                                 void *user_data) {
    (void) ctx;
    SignalingHandle sig = (SignalingHandle) user_data;

    if (wslay_is_ctrl_frame(arg->opcode)) {
        // wslay handles ping/close/pong queueing itself; just log for triage.
        if (WSLAY_CONNECTION_CLOSE == arg->opcode) {
            printf("[signaling] WS close (status=%u, len=%u)\n",
                   (unsigned) arg->status_code, (unsigned) arg->msg_length);
        }
        return;
    }

    // Replace any prior un-consumed message — KVS sends one envelope per text
    // frame, and signaling_wait_for_offer is expected to drain promptly.
    free(sig->latched_msg);
    sig->latched_msg = NULL;
    sig->latched_msg_len = 0;

    char *copy = malloc(arg->msg_length + 1);
    if (NULL == copy) {
        printf("[signaling] WS msg: OOM (%u bytes)\n", (unsigned) arg->msg_length);
        return;
    }
    memcpy(copy, arg->msg, arg->msg_length);
    copy[arg->msg_length] = '\0';
    sig->latched_msg = copy;
    sig->latched_msg_len = arg->msg_length;
    printf("[signaling] WS msg: opcode=0x%x len=%u\n",
           (unsigned) arg->opcode, (unsigned) arg->msg_length);
}

static const struct wslay_event_callbacks g_wslay_cbs = {
    wslay_recv_cb,
    wslay_send_cb,
    wslay_genmask_cb,
    NULL,                   // on_frame_recv_start
    NULL,                   // on_frame_recv_chunk
    NULL,                   // on_frame_recv_end
    wslay_on_msg_recv_cb,
};


SignalingHandle signaling_connect(const char *signed_url) {
    if (NULL == signed_url) {
        return NULL;
    }
    if (g_sig.connected) {
        printf("[signaling] signaling_connect called while already connected\n");
        return NULL;
    }

    char *host = NULL;
    const char *path = NULL;
    if (0 != wss_url_split(signed_url, &host, &path)) {
        return NULL;
    }

    // 1. Generate Sec-WebSocket-Key: 16 random bytes, base64-encoded.
    uint8_t nonce[WSS_NONCE_LEN];
    if (0 != webrtc_csprng_bytes(nonce, sizeof(nonce))) {
        printf("[signaling] csprng failed for Sec-WebSocket-Key\n");
        free(host);
        return NULL;
    }
    char nonce_b64[WSS_NONCE_B64_LEN];
    size_t nonce_b64_len = 0;
    if (0 != mbedtls_base64_encode((unsigned char *) nonce_b64, sizeof(nonce_b64), &nonce_b64_len, nonce, sizeof(nonce))) {
        printf("[signaling] base64 encode failed for Sec-WebSocket-Key\n");
        free(host);
        return NULL;
    }
    nonce_b64[nonce_b64_len] = '\0';

    // 2. Open TLS connection to host:443. Cert verify against AmazonRootCA1.
    cy_awsport_server_info_t server_info = {
        .host_name = host,
        .port      = WSS_PORT,
    };
    cy_awsport_ssl_credentials_t ssl = {
        .root_ca           = (const char *) IOTCL_AMAZON_ROOT_CA1,
        .root_ca_size      = strlen(IOTCL_AMAZON_ROOT_CA1) + 1,
        .root_ca_verify_mode = CY_AWS_ROOTCA_VERIFY_REQUIRED,
        .sni_host_name     = host,
        .sni_host_name_size = strlen(host) + 1,
    };

    cy_rslt_t r = cy_awsport_network_create(&g_sig.net_ctx, &server_info, &ssl, NULL, NULL);
    if (CY_RSLT_SUCCESS != r) {
        printf("[signaling] cy_awsport_network_create failed: 0x%08lx\n", (unsigned long) r);
        free(host);
        return NULL;
    }
    r = cy_awsport_network_connect(&g_sig.net_ctx, WSS_SOCK_SEND_TIMEOUT_MS, WSS_SOCK_RECV_TIMEOUT_MS);
    if (CY_RSLT_SUCCESS != r) {
        printf("[signaling] cy_awsport_network_connect failed: 0x%08lx\n", (unsigned long) r);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    // 3. Build the upgrade request. Size the buffer from the actual URL —
    //    presigned URLs run multi-KB once the URI-encoded session token is
    //    in there, so a fixed scratch doesn't cut it.
    size_t req_cap = strlen(path) + strlen(host) + WSS_REQ_FIXED_OVERHEAD;
    char *req = malloc(req_cap);
    if (NULL == req) {
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }
    int req_len = snprintf(req, req_cap,
        "GET %s HTTP/1.1\r\n"
        "Host: %s\r\n"
        "Upgrade: websocket\r\n"
        "Connection: Upgrade\r\n"
        "Sec-WebSocket-Key: %s\r\n"
        "Sec-WebSocket-Version: 13\r\n"
        "\r\n",
        path, host, nonce_b64
    );
    if (req_len <= 0 || (size_t) req_len >= req_cap) {
        printf("[signaling] WSS upgrade request did not fit in %d bytes\n", (int) req_cap);
        free(req);
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    int32_t sent = cy_awsport_network_send(&g_sig.net_ctx, req, (size_t) req_len);
    free(req);
    if (sent != req_len) {
        printf("[signaling] WSS upgrade send short/failed: %d/%d\n", (int) sent, req_len);
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    // 4. Receive the response head.
    uint8_t resp[WSS_RESP_BUF_LEN];
    int resp_len = wss_recv_head(&g_sig.net_ctx, resp, sizeof(resp));
    if (resp_len < 0) {
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    // 5. Verify status line is "HTTP/1.1 101".
    //    Min length of a valid 101 line is "HTTP/1.1 101 X\r\n" — 16 bytes.
    if (resp_len < 16 || 0 != memcmp(resp, "HTTP/1.1 101", 12)) {
        // Print the status line for triage.
        size_t line_end = 0;
        while (line_end + 1 < (size_t) resp_len && !(resp[line_end] == '\r' && resp[line_end+1] == '\n')) line_end++;
        printf("[signaling] WSS upgrade not 101: %.*s\n", (int) line_end, (const char *) resp);
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    // 6. Find Sec-WebSocket-Accept and verify it matches base64(SHA1(key+GUID)).
    //    Skip the status line so the header search starts at the first header.
    size_t hdr_off = 0;
    while (hdr_off + 1 < (size_t) resp_len && !(resp[hdr_off] == '\r' && resp[hdr_off+1] == '\n')) hdr_off++;
    hdr_off += 2;
    size_t accept_len = 0;
    const char *accept_val = wss_find_header((const char *) resp + hdr_off, (size_t) resp_len - hdr_off,
                                             "Sec-WebSocket-Accept", &accept_len);
    if (NULL == accept_val) {
        printf("[signaling] WSS upgrade response missing Sec-WebSocket-Accept\n");
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }
    char expected[WSS_ACCEPT_B64_LEN];
    if (0 != wss_compute_accept(nonce_b64, expected, sizeof(expected))) {
        printf("[signaling] failed to compute expected Sec-WebSocket-Accept\n");
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }
    size_t expected_len = strlen(expected);
    if (accept_len != expected_len || 0 != memcmp(accept_val, expected, expected_len)) {
        printf("[signaling] Sec-WebSocket-Accept mismatch (got %.*s, want %s)\n",
            (int) accept_len, accept_val, expected);
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    free(host);

    // 7. 101 verified — hand the open NetworkContext_t to wslay. From here on
    //    all I/O on this connection goes through the event-loop callbacks.
    int wrc = wslay_event_context_client_init(&g_sig.ws_ctx, &g_wslay_cbs, &g_sig);
    if (0 != wrc) {
        printf("[signaling] wslay_event_context_client_init failed: %d\n", wrc);
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        return NULL;
    }

    g_sig.connected = true;
    g_sig.transport_error = false;
    g_sig.latched_msg = NULL;
    g_sig.latched_msg_len = 0;
    printf("[signaling] WS upgrade OK (101 Switching Protocols)\n");
    return &g_sig;
}

void signaling_disconnect(SignalingHandle sig) {
    if (NULL == sig || !sig->connected) {
        return;
    }
    if (NULL != sig->ws_ctx) {
        wslay_event_context_free(sig->ws_ctx);
        sig->ws_ctx = NULL;
    }
    free(sig->latched_msg);
    sig->latched_msg = NULL;
    sig->latched_msg_len = 0;
    cy_awsport_network_disconnect(&sig->net_ctx);
    cy_awsport_network_delete(&sig->net_ctx);
    sig->connected = false;
}

// Drive the wslay event loop until a non-control message arrives, the peer
// closes, or the socket dies. Returns 0 on message (with *out_offer set), -1
// on transport / protocol error or remote close.
//
// No wall-clock budget — we're MASTER and may idle indefinitely waiting for
// a viewer (browser) to publish. The recv callback's
// per-call socket timeout (WSS_SOCK_RECV_TIMEOUT_MS) keeps the loop
// cooperative; shutdown from app_webrtc_stop() cuts the socket, which the
// recv callback observes as < 0 and propagates as transport_error.
//
// The TODO past this point is parsing the JSON envelope (messageType /
// messagePayload, base64-decoded) into a real SDP offer string.
int signaling_wait_for_offer(SignalingHandle sig, const char **out_offer) {
    if (NULL == sig || NULL == out_offer || !sig->connected || NULL == sig->ws_ctx) {
        return -1;
    }
    *out_offer = NULL;

