avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/signaling.c
    // Free any prior un-consumed latched message before we start polling — the
    // caller has had its chance to read the previous one.
    free(sig->latched_msg);
    sig->latched_msg = NULL;
    sig->latched_msg_len = 0;

    for (;;) {
        // Send any queued frames first (close, pong, future messages).
        if (wslay_event_want_write(sig->ws_ctx)) {
            int wrc = wslay_event_send(sig->ws_ctx);
            if (0 != wrc && NULL == sig->latched_msg) {
                printf("[signaling] wslay_event_send: %d\n", wrc);
                return -1;
            }
        }

        int recv_err = 0;
        if (wslay_event_want_read(sig->ws_ctx)) {
            recv_err = wslay_event_recv(sig->ws_ctx);
        }

        // The on_msg_recv callback fires synchronously inside wslay_event_recv,
        // so a message may have been latched on this same iteration even if
        // recv subsequently saw a socket close. Always check latched_msg before
        // treating an error as fatal — the message is the goal, the socket
        // staying open past it is not.
        if (NULL != sig->latched_msg) {
            *out_offer = sig->latched_msg;
            return 0;
        }

        if (0 != recv_err) {
            printf("[signaling] wslay_event_recv: %d\n", recv_err);
            return -1;
        }

        if (sig->transport_error) {
            return -1;
        }

        if (!wslay_event_want_read(sig->ws_ctx) && !wslay_event_want_write(sig->ws_ctx)) {
            // Read+write both disabled (close received / shutdown), nothing
            // left to do.
            printf("[signaling] WS read+write both disabled; closing\n");
            return -1;
        }

        // Yield. The recv callback already blocks up to WSS_SOCK_RECV_TIMEOUT_MS,
        // but want_read may be 0 (e.g., right after a control-frame round trip),
        // so a small extra yield keeps this loop cooperative.
        vTaskDelay(pdMS_TO_TICKS(20));
    }
}

int signaling_send_answer(SignalingHandle sig, const char *sdp_answer) {
    (void) sig;
    (void) sdp_answer;
    printf("[signaling] signaling_send_answer: STUB\n");
    return -1;
}
